# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [3]:
# import libraries here
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [18]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [9]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
Two categories and one value, with decimals. Id assume its in Celsius but them gringos arent to be trusted with the Fahrenheit nonsense
"""

#### Select the rows where state is New York.

In [11]:
temp.loc[temp["State"] == "New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [16]:
ny = temp.loc[temp["State"] == "New York"]
print("Average Temperature is", round(ny.Temperature.mean(),2), "Celsius")

Average Temperature is 10.74 Celsius

#### Which states and cities have a temperature above 15 degrees Celsius?

In [19]:
temp.loc[temp["Temperature"] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [28]:
cities = temp.loc[temp["Temperature"] > 15]["City"]
cities.reset_index().drop(["index"],axis=1)

       City
0       NYC
1  Hartford
2    Treton
3    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [37]:
# your code here
temp[temp['Temperature'].between(15, 19.99)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [54]:
cols = ["mean", "std"]
df = pd.DataFrame(columns=cols)

df["mean"] = temp.groupby(["State"]).mean()["Temperature"]
df["std"] = temp.groupby(["State"]).std()["Temperature"]


df

                  mean       std
State
Connecticut  17.222222       NaN
New Jersey   21.111111  1.571348
New York     19.444444       NaN

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [55]:
# your code here
employees = pd.read_csv("Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [56]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [57]:
"""
Nothing special, but if i need to operate on the values I'd convert them to float instead
"""

"\nNothing special, but if i need to operate on the values I'd convert them to float instead\n"

#### What's the average salary in this company?

In [62]:
print("Average salary is", round(employees["Salary"].mean(),2), "units")

Average salary is 48.89 units

#### What's the highest salary?

In [64]:
print("Highest salary is", employees["Salary"].max(), "units")

Highest salary is 70 units

#### What's the lowest salary?

In [65]:
print("Lowest salary is", employees["Salary"].min(), "units")

Lowest salary is 30 units

#### Who are the employees with the lowest salary?

In [67]:
employees.loc[employees["Salary"] == employees["Salary"].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [68]:
employees.loc[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [71]:
employees.loc[employees["Name"] == "David"]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [72]:
employees.loc[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [82]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [74]:
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [88]:
employees.loc[(employees["Salary"] > 55) & (employees["Title"] == "associate")]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [96]:
employees.groupby(["Years"]).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [97]:
employees.groupby(["Title"]).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [101]:
mean = employees["Salary"].mean()
std = employees["Salary"].std()
q1 = mean - std
q3 = mean + std
print("Q1 ->", round(q1,2))
print("Q2 ->", round(mean,2))
print("Q3 ->", round(q3,2))

Q1 -> 32.35
Q2 -> 48.89
Q3 -> 65.43

#### Is the mean salary different per gender?

In [102]:
#Yes, but could be related to also a higher tenure of workers
employees.groupby(["Gender"]).mean()

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [111]:
# Minimums here
mini = employees.groupby("Department").min()
mini.drop(["Name","Education","Gender","Title"], axis=1, inplace=True)
mini

            Years  Salary
Department
HR              2      30
IT              1      30
Sales           2      55

In [112]:
# Maximums here
maxi = employees.groupby("Department").max()
maxi.drop(["Name","Education","Gender","Title"], axis=1, inplace=True)
maxi

            Years  Salary
Department
HR              8      70
IT              8      70
Sales           3      55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [113]:
test = maxi - mini
test

            Years  Salary
Department
HR              6      40
IT              7      40
Sales           1       0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here